[
    {
        "Name": "Lauki Kofta",
        "Ingredients":[
                        "2 cups grated lauki (bottle gourd or opo squash or dudhi)",
                        "3.5 to 4 tablespoon besan (gram flour)",        
                        "¼ teaspoon garam masala powder",        
                        "⅓tsp-Red chilli powder",        
                        "salt as required",
                        "oil for deep or shallow frying the koftas",
                        "2 large tomatoes - roughly chopped",
                        "1 medium sized onion - roughly chopped",
                        "4 to 5 garlic (lahsun) - chopped",
                        "1 inch ginger (adrak) - chopped",
                        "2 tablespoon broken cashews",
                        "1 teaspoon cumin",
                        "¼ teaspoon turmeric powder",
                        "1 teaspoon coriander powder",
                        "1 cup water or as required"
                    ],
        "Steps":
            [
            "01. Rinse and peel the lauki (bottle gourd). Grate it.",
            "02. Squeeze the grated lauki and collect the juice in a bowl or mug. Keep the juice aside.",
            "03. Mix all the ingredients for making the koftas with the grated lauki except oil.",
            "04. Make small round shaped balls or patties.",
            "05. Heat oil in a kadai or frying pan. fry the lauki kofta in the oil, till they are even golden browned from all sides.",
            "06. Drain the fried kofta on tissues so that the extra oil is absorbed and make a masala paste with spices",
            "07. Remove extra oil from the frying pan in which the koftas were fried. Keep about 1.5 or 2 tbsp oil.",
            "08. Heat the oil and first fry the cumin. Then add the masala paste and Fry for 8-10 minutes and then add all the spice powders.",
            "09. Stir and continue to fry the masala paste till it starts leaving oil from the sides.Add the juice and about 1 cup water to the paste.",
            "10. Stir and simmer for 10-12 minutes. Lastly, add the fried kofta. Switch off the fire and let them be in the curry for a few minutes.",
            "11.Garnish with coriander leaves and serve lauki kofta hot with rotis, naan or jeera rice."
            ],
        "Image":"https://cdn1.foodviva.com/static-content/food-images/lunch-recipes/lauki-kofta-curry/lauki-kofta-curry.jpg"
    },

    {
        "Name": "Paneer Butter Masala",
        "Ingredients":[
                        "18 to 20 whole cashews",
                        "2 cup hot water for soaking cashews",      
                        "2 cups diced tomatoes or 300 grams tomatoes or 4 to 5 medium size – pureed",  
                        "2 inch ginger",            
                        "3 to 4 medium -sized garlic cloves",            
                        "2 tablespoons butter or 1 tablespoon oil + 1 or 2 tablespoons butter",            
                        "1 tej patta (Indian bay leaf) – optional",            
                        "½ to 1 teaspoon kashmiri red chili powder",            
                        "1 or 2 green chili – slit, reserve a few for garnish",         
                        "200 to 250 grams paneer (Indian cottage cheese) – cubed or diced",
                        "1 teaspoon kasuri methi (dry fenugreek leaves) – optional",
                        "½ to 1 teaspoon garam masala or tandoori masala",
                        "2 to 3 tablespoons fresh cream",
                        "¼ to 1 teaspoon sugar – optional",
                        "1 to 2 teaspoons butter – optional",
                        "salt as required",
                        "1 to 2 tablespoons chopped coriander leaves (cilantro ) – optional"
                    ],
        "Steps":[
                "01. Soak cashews in a hot water for 20 to 30 minutes. When the cashews are soaking, you can prep the other ingredients like chopping tomatoes, preparing ginger-garlic paste, slicing paneer etc.",
                "02. Then drain and add the soaked cashews in a blender or grinder.  Add 2 to 3 tablespoons water and grind to a smooth paste without any tiny bits or pieces of cashews.",            
                "03. In the same blender add the roughly chopped tomatoes. No need to blanch the tomatoes before blending.Blend to a smooth tomato puree. Keep aside. Don’t add any water while blending the tomatoes.",      
                "04. Melt butter in a pan on a low flame. Add tej patta and fry for 2 to 3 seconds or till the oil become fragrant. Add ginger-garlic paste and sauté for some seconds till the raw aroma disappears.",
                "05. Add the tomato puree and stir well. Cook for 5 to 6 minutes. Then add kashmiri red chili powder and stir again. Continue to sauté till the oil starts to leave the sides of the tomato paste. The tomato paste will thicken considerably and will start coming together as one whole lump. ",
                "06. Then add cashew paste and stir well. Sauté the cashew paste for a few minutes till the oil begins to leave the sides of the masala paste. The cashew paste will begin to cook fast. Approx 3 to 4 minutes on a low flame. So keep stirring non-stop.",
                "07. Add water and mix very well. Simmer on a low flame. The curry will come to a boil. After 2 to 3 minutes of boiling, add ginger julienne. Reserve a few for garnishing. The curry will also begin to thicken.",
                "08. Add julienned ginger and green chillies, salt and sugar and simmer till the curry begins to thicken. After 3 to 4 minutes, add slit green chillies. also add salt as per taste and ½ to 1 teaspoon sugar (optional).",
                "09. You can vary the sugar quantity from ¼ tsp to 1 teaspoon or more depending on the sourness of the tomatoes. Sugar is optional and you can skip it too. If you add cream, then you will need to add less sugar. Mix very well and simmer for a minute.",
                "10. After the gravy thickens to your desired consistency, then add the paneer cubes and stir gently. i keep the gravy to a medium consistency. After that add crushed kasuri methi (dry fenugreek leaves), garam masala and cream. Gently mix and then switch off the flame. ",            
                "11. Garnish it with coriander leaves and ginger julienne. You can even dot the gravy with some butter or drizzle some cream. ",            
                "12. Serve paneer butter masala hot with plain naan, garlic naan, roti, paratha or steamed basmati or jeera rice or even peas pulao. Side accompaniments can be an onion-cucumber salad or some pickle. Also serve some lemon wedges by the side. "
                ],
        "Image":"https://static.toiimg.com/thumb/53098531.cms?imgsize=246555&width=800&height=800"
    },

    {
        "Name": "Simple Macaroni and Cheese Pasta",
        "Ingredients":[
                        "1 (8 ounce) box elbow macaroni",
                        "¼ cup butter",      
                        "¼ cup all-purpose flour",  
                        "½ teaspoon salt",            
                        "ground black pepper to taste",            
                        "2 cups milk",            
                        "2 cups shredded Cheddar cheese"
                    ],
        "Steps":["01. Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.",
            "02. Melt butter in a saucepan over medium heat; stir in flour, salt, and pepper until smooth, about 5 minutes. Slowly pour milk into butter-flour mixture while continuously stirring until mixture is smooth and bubbling, about 5 minutes.",            
            "03.  Add Cheddar cheese to milk mixture and stir until cheese is melted, 2 to 4 minutes.",      
            "04. Fold macaroni into cheese sauce until coated."],
        "Image":"https://spicysouthernkitchen.com/wp-content/uploads/velveeta-mac-and-cheese-22.jpg"
    },

    {
        "Name": "Veggie Pizza",
        "Ingredients":[
                        "2 (8 ounce) packages refrigerated parmesan",
                        "1 cup sour cream",      
                        "1 (8 ounce) package cream cheese, softened",  
                        "1 teaspoon dried dill weed",            
                        "¼ teaspoon ground paprika",            
                        "¼ teaspoon garlic salt",            
                        "1 teaspoon Chilli Flakes",
                        "1 teaspoon Oregano",
                        "1 red bell pepper, chopped",
                        "1 ½ cups fresh broccoli, chopped",
                        "1 small onion, finely chopped"],
        "Steps":[
            "01. Preheat oven to 350 degrees F (175 degrees C). Spray a jellyroll pan with non-stick cooking spray.",
            "02. Pat crescent roll dough into a jellyroll pan. Let stand 5 minutes. Pierce with fork.",            
            "03. Bake for 10 minutes, let cool.",      
            "04. In a medium-sized mixing bowl, combine sour cream, cream cheese, dill weed, garlic salt and ranch dip mix. ",
            "05. Spread this mixture on top of the cooled crust. Arrange the onion, carrot, celery, broccoli, radish, bell pepper and broccoli on top of the creamed mixture.",
            "06. Cover and let chill. Once chilled, cut it into squares and serve"
            ],
        "Image":"https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Grilled-Veggie-Pizza_EXPS_LSBZ18_48960_D01_18_6b.jpg"
    },

    {
        "Name": "Veg Biryani Recipe",
        "Ingredients":[
                        "1 cup basmati rice or 180 grams of basmati rice",
                        "4 cups water",      
                        "1 teaspoon salt",  
                        "1 inch cinnamon",            
                        "1 medium tej patta or 2 small tej patta",            
                        "2 to 3 cloves",            
                        "2 to 3 green cardamoms",            
                        "200 to 250 grams Paneer (cottage cheese)",
                        "8 tablespoon Curd (yogurt)",
                        "1 teaspoon ginger paste or 1 inch ginger crushed to a paste in a mortar-pestle",
                        "1 teaspoon garlic paste or 4 to 5 garlic cloves crushed to a paste in a mortar-pestle",
                        "2 green chilies, chopped or 1 teaspoon chopped green chilies",
                        "1 tablespoon chopped coriander leaves (cilantro leaves)",
                        "½ tablespoon chopped mint leaves",
                        "¼ teaspoon red chili powder",
                        "½ teaspoon coriander powder (ground coriander)",
                        "1 teaspoon lime juice",
                        "salt as required",
                        "1 tablespoon ghee (clarified butter)",
                        "16 to 18 saffron strands",
                        "½ tablespoon chopped mint leaves"
                    ],
        "Steps":[
                "01. Rinse basmati rice very well in water till the starch clears from the water. The water should be clear and not cloudy or opaque. Then soak the rice in water for 30 minutes. Later drain the rice well and keep aside.",
                "02. Bring 4 cups water to a rolling boil in a pot. Add whole spices - 1 inch cinnamon, 1 medium bay leaf or 2 small bay leaves, 2 to 3 cloves , 2 to 3 green cardamoms & 1/4 tsp shahjeera/caraway seeds. Also add 1 tsp salt.",            
                "03. Now add the soaked rice. Do not stir the rice. Keep the flame to high and cook the rice without lowering the temperature. The rice grains have to be cooked till 75% or 3/4th. They should have a bite to them when eaten.",      
                "04. Drain the rice in a colander. You can also rinse the rice grains to remove starch if any and to stop the grains from cooking. Cover with a lid and keep the rice aside.",
                "05. Warm 4 tbsp milk on stove top or in the microwave. Add 16 to 18 saffron strands to the milk. Stir and keep aside.",
                "06. Whisk 8 tbsp fresh full fat curd (yogurt) in a mixing bowl till smooth. Add 1 tsp ginger paste, 1 tsp garlic paste, 1 tsp chopped green chilies, 1 tbsp chopped coriander leaves and 1/2 tbsp chopped mint leaves to the mix well.",
                "07. Now add the spices- 1/4 tsp turmeric powder, 1/4 tsp red chili powder, 1/4 tsp garam masala powder, 1/2 tsp coriander powder, 1/4 tsp shahjeera/caraway seeds, 1 tsp lime juice and salt as required. Mix again.",
                "08. Then add the 1/2 of the fried onions and paneer cubes. Mix gently. Cover and keep the marinated paneer aside for 30 minutes Add the same oil in which we fried the onions to a pan or pot. Add the marinated paneer and layer neatly.",
                "09. Make a rice layer now. Add all the rice. I have just made two layers. If you want you can make 4 layers. Add the remaining fried onions, 1 tbsp chopped coriander and 1/2 tbsp mint leaves.",
                "10. Sprinkle the saffron flavored and colored milk. Dot with 1 tbsp ghee. You can also add 1 tsp of rose water or kewra water.",
                "11. Cover with a foil or with a moist cloth. Place the lid tightly on the pan and place it on a tava or griddle. For the first 5 minutes dum cook the paneer biryani on a medium flame.Then lower the flame and cook the paneer biryani",
                "12. On dum for 12 to 15 minutes. You can also cook the paneer biryani in a preheated oven for 20 to 25 minutes at 180 degrees celsius. Use an oven proof pan.Serve the paneer biryani hot with boondi raita or cucumber raita or onion tomato raita or kuchumber salad."
            ],
        "Image":"https://www.whiskaffair.com/wp-content/uploads/2020/08/Veg-Biryani-2-3-500x375.jpg" 
    }
]